src/InformationRegisters/инкНалоговыеУведомления/инкНалоговыеУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкНалоговыеУведомления</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>АвансНДФЛСНСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвансНДФЛСОсновногоДоходаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвансНДФЛСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВзносыСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДФЛСНСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДФЛСОсновногоДоходаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДФЛСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУдержанияВПериоде</name>
    <type>
      <types>EnumRef.инкВидУдержанияВПериоде</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкНалоговыеУведомления/ManagerModule.bsl
// Функция - Получить код периода для отчетов:
//
// Параметры:
//  МесяцДата	 - Дата	 - Месяц за который получаются данные:
// 
// Возвращаемое значение:
//   - Структура
//
Функция ПолучитьКодПериода(МесяцДата) Экспорт
	
	КодПериода = Новый Структура;
	КодПериода.Вставить("ПерваяПоловинаМесяца");
	КодПериода.Вставить("ВтораяПоловинаМесяца");
	КодПериода.Вставить("КодСФР");

	НомерМесяца = Месяц(МесяцДата);

	Если НомерМесяца = 1 Тогда
		КодПериода.ПерваяПоловинаМесяца = "21/11";
		КодПериода.ВтораяПоловинаМесяца = "21/02";
		КодПериода.КодСФР				= "21/01";
	ИначеЕсли НомерМесяца = 2 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "21/12";
		КодПериода.ВтораяПоловинаМесяца = "21/03";
		КодПериода.КодСФР				= "21/02";
	ИначеЕсли НомерМесяца = 3 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "21/13";
		КодПериода.ВтораяПоловинаМесяца = "31/01";
		КодПериода.КодСФР				= "21/03";
	ИначеЕсли НомерМесяца = 4 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "31/11";
		КодПериода.ВтораяПоловинаМесяца = "31/02";
		КодПериода.КодСФР				= "31/01";
	ИначеЕсли НомерМесяца = 5 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "31/12";
		КодПериода.ВтораяПоловинаМесяца = "31/03";
		КодПериода.КодСФР				= "31/02";
	ИначеЕсли НомерМесяца = 6 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "31/13";
		КодПериода.ВтораяПоловинаМесяца = "33/01";
		КодПериода.КодСФР				= "31/03";
	ИначеЕсли НомерМесяца = 7 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "33/11";
		КодПериода.ВтораяПоловинаМесяца = "33/02";
		КодПериода.КодСФР				= "33/01";
	ИначеЕсли НомерМесяца = 8 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "33/12";
		КодПериода.ВтораяПоловинаМесяца = "33/02";
		КодПериода.КодСФР				= "33/02";
	ИначеЕсли НомерМесяца = 9 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "33/13";
		КодПериода.ВтораяПоловинаМесяца = "34/01";
		КодПериода.КодСФР				= "33/03";
	ИначеЕсли НомерМесяца = 10 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "34/11";
		КодПериода.ВтораяПоловинаМесяца = "34/02";
		КодПериода.КодСФР				= "34/01";
	ИначеЕсли НомерМесяца = 11 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "34/12";
		КодПериода.ВтораяПоловинаМесяца = "34/03";
		КодПериода.КодСФР				= "34/02";
	ИначеЕсли НомерМесяца = 12 Тогда	
		КодПериода.ПерваяПоловинаМесяца = "34/13";
		КодПериода.ВтораяПоловинаМесяца = "34/04";
		КодПериода.КодСФР				= "34/03";
	КонецЕсли;
	
    Возврат КодПериода;	
	
КонецФункции

// Функция - Получить налоговое уведомление таблица
//
// Параметры:
//  ДанныеЗапроса	 - Структура	 - Данные для запроса
// 
// Возвращаемое значение:
//   - ТаблицаЗначений;
//
Функция ПолучитьНалоговыеУведомленияТаблица(ДанныеЗапроса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкНалоговыеУведомления.Период КАК Период,
		|	инкНалоговыеУведомления.Организация КАК Организация,
		|	СУММА(инкНалоговыеУведомления.АвансНДФЛСумма) КАК АвансНДФЛСумма,
		|	СУММА(инкНалоговыеУведомления.ВзносыСумма) КАК ВзносыСумма,
		|	СУММА(инкНалоговыеУведомления.НДФЛСумма) КАК НДФЛСумма,
		|	СУММА(ЕСТЬNULL(инкНалоговыеУведомления.АвансНДФЛСумма, 0) + ЕСТЬNULL(инкНалоговыеУведомления.НДФЛСумма, 0)) КАК НалогСумма
		|ИЗ
		|	РегистрСведений.инкНалоговыеУведомления КАК инкНалоговыеУведомления
		|ГДЕ
		|	инкНалоговыеУведомления.Период МЕЖДУ &Дата1 И &Дата2
		|	И инкНалоговыеУведомления.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	инкНалоговыеУведомления.Период,
		|	инкНалоговыеУведомления.Организация";
	
	Запрос.УстановитьПараметр("Дата1", ДанныеЗапроса.Дата1);
	Запрос.УстановитьПараметр("Дата2", ДанныеЗапроса.Дата2);
	Запрос.УстановитьПараметр("Организация", ДанныеЗапроса.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
